claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
       }
     line_lcd=0;
     printf("\nSetClock");
      Set_Clock();

    }

       //Read Status register from eepom and update it
      //size=sizeof(status);
     //u16 status
     *(u16*)(&status)=(u16)(FLASH_ReadByte(EEPROM_ADR_STATUSH)*256)+(u16)FLASH_ReadByte(EEPROM_ADR_STATUSL);
      status_check = *(u16*)(&status);
    //When Start Check for Allarm and computing Daily_long_on
     if ( Read_Allarm() == TRUE)
     {
       time_on=daily_hour_on*60+daily_minute_on;
       time_off= daily_hour_off*60+daily_minute_off;
     }

     //UART2_Cmd(DISABLE);  // Disable UART for the moment

     // Working fuction
    //Set_DS1307(13,7,13,34,0);//u8 year ,u8 mounts,u8 hours,u8 minutes,u8 seconds)



    // strcpy(line1,"Hello I am here! ");
    //  while(1)
    //  {
    //     Display_Line(line1);
    //     Delay2(20000);
    //  }
    //  while (!key_ok_on());
       //sprintf(line1,"TIMER ON ");
    while(1)
    {
      ADC1_Cmd (ENABLE);

       GPIO_WriteReverse(GPIOD, (GPIO_Pin_TypeDef)GPIO_PIN_0 );
         Delay2(10000);
         ttimer++;
       GPIO_WriteReverse(GPIOD, (GPIO_Pin_TypeDef)GPIO_PIN_0 );
         Delay2(10000);

           //status_check = *(u16*)(&status);

      line_lcd=0;
     if (!ReadDS1307())
     {
       printf("\n E2:%d",error);
        //restart i2c
      // Reset the CPU: Enable the watchdog and wait until it expires
       IWDG->KR = IWDG_KEY_ENABLE;
       while ( 1 );    // Wait until reset occurs from IWDG

     }
       else
         //printf("\n      ");

     //line_lcd=2;
     //printf("\n Just Test:%X", timer2);
         //if (rx_data==SpecialSymbol) SendData();
      //SendData();

      if (key_ok_on())
      {
        line_lcd=0;
        printf("\n%02d:%02d:%02d",years,mounts,date);
        status.daily=1; //On Daily timer
        Save_Status();
        Delay2(50000);
        Clear_Line1();
        //Delay2(10000);
        //Delay2(10000);
      }

      if(key_ok_plus()) Set_Delay_Allarm();  //Set Daily Allarm
      if(key_plus_on()) Power_On();
      if(key_minus_on())Power_Off();


      //Check for Allarm
          if (status.daily==1)
        {
      u16 time_now=hours*60+minutes;
      status.on=0;
           u16 time=time_on;
           do
          {
             if(time==time_now)
             {
               status.on=1;
                break ;
             }
              time++;
               if( time==1441) time=0;
          } while(!(time==time_off));
         };


            //Read Temperature
        // if( ttimer > 5 )
         //{
            result1=temperature();
            result2=0;
            if(result1%2!=0) result2=5;
            result1/=2;
           // char result3;
           // ttimer=0;
       //  }

         //printf("\n%d.%d",result1,result2);

           //Display
           // line_lcd=0;
           if (status.daily==1)  sprintf(string1,"TIMER ON");
            else sprintf(string1,"TIMER OFF");

             if ( ttimer==10)
             {
            sprintf(line1,"%d.%d°C %s ",result1,result2,string1);
            ttimer=0;
             }
            Display_Line(line1);
          line_lcd=1;
          printf("\n%02d:%02d:%02d",hours,minutes,seconds);


           if(status.on) GPIO_WriteHigh(GPIOD, power_pin );
             else   GPIO_WriteLow(GPIOD, power_pin );



    }



}

void Power_On()
{
  status.on=1;
  status.daily=0; //Off Daily timer
  Save_Status();
}

void Power_Off()
{
  status.on=0;
  status.daily=0; //Off Daily timer
  Save_Status();
}

void InitI2C(void)
{
   I2C_DeInit();
   I2C_Init(10000, 0xA2, I2C_DUTYCYCLE_2, I2C_ACK_CURR, I2C_ADDMODE_7BIT, 2);
   I2C_Cmd(ENABLE);
}

bool I2C_Start(void)
{
   I2C_GenerateSTART(ENABLE);
       timeout=100;
    	while(!(I2C_CheckEvent(I2C_EVENT_MASTER_MODE_SELECT))&&timeout);
        if (!timeout)
        {
            error=1;
           return FALSE;
        }
          else return TRUE;
}

bool I2C_WA(u8 address)
{
  I2C_Send7bitAddress(address, I2C_DIRECTION_TX);
       timeout=255;
        while(!(I2C_CheckEvent(I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&&timeout);
         if (!timeout)
         {
          error=2;
           return FALSE ;
         }
          else return TRUE;
}

bool I2C_RA(u8 address)
{
  I2C_Send7bitAddress(address, I2C_DIRECTION_RX);
       timeout=255;
        while(!(I2C_CheckEvent(I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))&&timeout);
         if (!timeout)
         {
           error=3;
           return FALSE ;
         }
          else return TRUE;
}


bool I2C_WD(u8 data)
{
 I2C_SendData(data);   // set register pointer 00h
   timeout=255;
   while(!(I2C_CheckEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED))&&timeout);
    if (!timeout)
    {
      error=4;
       return FALSE ;
    }
     else return TRUE;
}

u8 I2C_RD(void)
{
 timeout=255;
  while( !I2C_GetFlagStatus(I2C_FLAG_TRANSFERFINISHED)&& timeout);
 //while((!(I2C->SR1 & 0x40))&&timeout);
 if (!timeout)
 {
   error=5;
   return FALSE;
 }
 u8 data=I2C_ReceiveData();
 return data;
}

  /*
bool Init_DS1307(void)
{
   // Test DS1307
    error=0;
    if (!I2C_Start()) return FALSE;
    if(!I2C_WA(0xD0)) return FALSE;
    if(!I2C_WD(0x00)) return FALSE;
    if(!I2C_WD(0x00)) return FALSE;
    I2C_GenerateSTOP(ENABLE);

    // timeout=100;  error=4;
    ///   while(!(I2C_CheckEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED))&&timeout);
    //    if (!timeout)return FALSE ;
     return TRUE;
}
   */

bool  ReadDS1307(void)
{
       error=0;
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0))return FALSE;
       if(!I2C_WD(0x00)) return FALSE;
       I2C_GenerateSTOP(ENABLE);
       if (!I2C_Start()) return FALSE;
       if(!I2C_RA(0xD0))return FALSE;
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       seconds = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       minutes = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       hours = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       days = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       date = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       mounts = bcd2hex(I2C_RD());
       I2C_AcknowledgeConfig(I2C_ACK_NONE);
         I2C_GenerateSTOP(ENABLE);
          years= bcd2hex(I2C_RD());

     //  I2C_AcknowledgeConfig(I2C_ACK_CURR);
     //   u8 data1 = I2C_RD();
      //Last read byte by I2C slave
     //  I2C_AcknowledgeConfig(I2C_ACK_NONE);
     //  I2C_GenerateSTOP(ENABLE);
     //  temp2= I2C_RD();
       if( seconds & 0x80 )    //if not enable the oscillator ?
          {
            seconds &= 0x7f;
            Set_DS1307();
          }

