claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
       return TRUE;
}

bool Check_DS1307(void)
{
   // Read  address 0x08 from DS1307 if not 0XAA clock is not set
       error=0;
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0)) return FALSE;
       if(!I2C_WD(0x08)) return FALSE;
       I2C_GenerateSTOP(ENABLE);
        //Last read byte by I2C slave
       if (!I2C_Start()) return FALSE;
       if(!I2C_RA(0xD0))return FALSE;
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       u8 data = I2C_RD();
       I2C_AcknowledgeConfig(I2C_ACK_NONE);
       I2C_GenerateSTOP(ENABLE);
       if (data != 0xAA) return FALSE;
       else return TRUE;
}

bool Set_DS1307()
{
       // convert hex or decimal to bcd format


       error=0;
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0)) return FALSE;
       if(!I2C_WD(0x00)) return FALSE;
       if(!I2C_WD(convert_tobcd(seconds))) return FALSE;
       if(!I2C_WD(convert_tobcd(minutes))) return FALSE;
       if(!I2C_WD(convert_tobcd(hours))) return FALSE;
       if(!I2C_WD(convert_tobcd(days))) return FALSE;
       if(!I2C_WD(convert_tobcd(date))) return FALSE;
       if(!I2C_WD(convert_tobcd(mounts))) return FALSE;
       if(!I2C_WD(convert_tobcd(years)))return FALSE;
       if(!I2C_WD(DS_Control))return FALSE;
       if(!I2C_WD(0XAA)) return FALSE;  // Byte --> time is set by program
       I2C_GenerateSTOP(ENABLE);


   return TRUE;
}


u8 convert_tobcd(u8 data)
{
   u8 data_second_decimal=data/10;
   u8 data_first_decimal=data - 10*data_second_decimal;
   data=16*data_second_decimal + data_first_decimal;
  return data;
}

u8 bcd2hex(u8 bcd)
{
  u8 hex=0;
  hex=(bcd>>4)*10 +(bcd&0x0f);
  bcd=0;
  return hex ;
}


bool Set_Clock()
{
    //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nYears:");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",years,mounts,date);
       years=adj(0,99,years);
    } while (!key_ok_on());

     line_lcd=0;
    printf("\nMounts:");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",years,mounts,date);
       mounts=adj(1,12,mounts);
    } while (!key_ok_on());

    LCDInstr(0x01);
     Delay1(1000);
      line_lcd=0;
    printf("\nDate:");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",years,mounts,date);
       date=adj(1,31,date);
    } while (!key_ok_on());


    //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nDays:");
      do
    {
      line_lcd=1;
     printf("\n%02d",days);
       days=adj(1,7,days);
    } while (!key_ok_on());



   //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nHours:");
      do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       hours=adj(0,23,hours);
    } while (!key_ok_on());

     line_lcd=0;
     printf("\nMinutes:");
      do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       minutes=adj(0,59,minutes);
    } while (!key_ok_on());

    line_lcd=0;
    printf("\nSeconds:");
    do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       seconds=adj(0,59,seconds);
    } while (!key_ok_on());

      // Set parameter to DS1307 + time byte
      Set_DS1307();

      //bool k=Check_DS1307();

  return TRUE;
}


u8 adj(u8 min,u8 max,u8 now)
{
   u8 adj=now;
   if (key_plus_on()) adj ++;
   if (adj >max) adj = min;
   if (key_minus_on()) adj --;
   if ( adj == 255) adj=max;
   if (adj < min) adj=max;
   return adj ;
}


bool key_ok_on()
{
  //Read Key OK
  if (!(GPIO_ReadInputData(GPIOF)& key_ok))
   {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time_ok) && !(GPIO_ReadInputData(GPIOF)& key_ok) );;
        if (timer2>=key_time_ok) return TRUE;
   }

  return FALSE;
}

 bool key_plus_on()
{
  //Read Key OK
    if (!(GPIO_ReadInputData(GPIOA)& key_plus))
     {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !(GPIO_ReadInputData(GPIOA)& key_plus) );;
        if (timer2>=key_time) return TRUE;
     }

  return FALSE;
}

  bool key_minus_on()
{
  //Read Key OK
   if (!(GPIO_ReadInputData(GPIOA)& key_minus))
     {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !(GPIO_ReadInputData(GPIOA)& key_minus) );;
        if (timer2>=key_time) return TRUE;
     }

  return FALSE;
}


bool  key_ok_plus()
{
  if (!((GPIO_ReadInputData(GPIOF)& key_ok)|(GPIO_ReadInputData(GPIOA)& key_plus)))
  {
      timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !((GPIO_ReadInputData(GPIOF)& key_ok)|(GPIO_ReadInputData(GPIOA)& key_plus)));;
       if (timer2>=key_time) return TRUE;
  }

 return FALSE;
}


bool Set_Delay_Allarm()
{

   //clr
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nH On:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
       daily_hour_on=adj(0,23,daily_hour_on);
    } while (!key_ok_on());

   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin On:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
       daily_minute_on=adj(0,59,daily_minute_on);
    } while (!key_ok_on());

    LCDInstr(0x01);
    Delay1(1000);
    line_lcd=0;
    printf("\nH Off:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_hour_off=adj(0,23,daily_hour_off);
    } while (!key_ok_on());

  LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin Off:");
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_minute_off=adj(0,59,daily_minute_off);
    } while (!key_ok_on());

     //Computing time_long_on

