claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
}

void LCDInstr(u8 Instr)
{
  LCD_RS(0);
  LCD_RW(0);
  LCDDataOut(Instr>>4);
  PulseEnable();
  LCDDataOut(Instr & 0x0F);
  PulseEnable();
}

void LCDData(u8 Data)
{
  LCD_RS(1);
  LCD_RW(0);
  LCDDataOut(Data>>4);
  PulseEnable() ;
  LCDDataOut(Data & 0x0F) ;
  PulseEnable();
}

void LCDInstrNibble(u8 Instr)
{
  LCD_RS(0);
  LCD_RW(0);
  LCDDataOut(Instr & 0x0F);
  PulseEnable();
}

void PulseEnable(void)
{
  LCD_EN(0);
   Delay1(1);
  LCD_EN(1);
   Delay1(1);
  LCD_EN(0);
   Delay1(1);
}

void LCD_Busy(void)
{
   //set Port D7 as Input
   GPIO_Init(LCD_PORT,DATA7,GPIO_MODE_IN_PU_NO_IT);
   //Set Read
   LCD_RW(1);
   LCD_RS(0);
   // Read Busy Flag
      timer2=0;
   do
   {
   // Enable set
     LCD_EN(0);
      Delay1(1);
     LCD_EN(1);
      Delay1(1);
   } while (GPIO_ReadInputPin(LCD_PORT, DATA7));
      k=timer2;
      //Clear read
    LCD_RW(0);
   //set Port D7 as Output
   GPIO_Init(LCD_PORT,DATA7,GPIO_MODE_OUT_PP_HIGH_FAST);

}


void LCD(u8 data)
 {
   //  static u8 linet=0;


     if (data =='\n')     //r
     {

         switch(line_lcd)
         {
         case 0:
           LCDInstr(0x80 | 0x00);
           count=0;
           break;
         case 1:
           LCDInstr(0x80 | 0x40);
           count=20;
           break;
         case 2:
           LCDInstr(0x80 | 0x14);
           count=40;
           break;
         case 3:
           LCDInstr(0x80 | 0x54);
           count=60;
           break;
         //default:
          //  LCDInstr(0x80 |0x40);    //Line 1
          }
         line_lcd++;
         if (line_lcd>=5)
         {
          line_lcd=1;   //line >=5
          LCDInstr(0x01); //Clear LCD
          Delay1(2500);
         }

         Delay1(1);


     }


     if (count==20)
      {
        LCDInstr(0x80 | 0x40);
        Delay1(1);
      }
         else if(count==40)
        {
          LCDInstr(0x80 | 0x14);
          Delay1(1);
        }
          else if(count==60)
          {
            LCDInstr(0x80 | 0x54);
            count=0;
            Delay1(1);
          }
            else if(count >80)
              {
                count=0;
                LCDInstr(0x01); //Clear LCD
                Delay1(250);
              }


    /*
         line++;
         if (line>3)
         {
           line=1;  //Line 0 for Time
         }
       switch(line)
         {
         case 1 :LCDInstr(0x80 | 0x40);break;  //Line 1
         case 2 :LCDInstr(0x80 | 0x14);break;  //Line 2
         case 3 :LCDInstr(0x80 | 0x54);break;  //Line 3
         default : LCDInstr(0x80 | 0x40); // Line 1
         }
         Delay(1);
         count=0;
      }

     */

     if (data > 0x1b)   //Display only valid data
     {
       LCDData(data);
        Delay1(1);
       count++;
     }
 }

void InitDelayTimer()
{
   //Timer 2 use for Delay  long Delay is 40ms for lcd
   //Tclock 16/8=2Mhz  /20 10us
       TIM2_DeInit();
       TIM2_TimeBaseInit(TIM2_PRESCALER_2,0X0050);
       //TIM2_PrescalerConfig(TIM2_PRESCALER_1, TIM2_PSCRELOADMODE_IMMEDIATE);
       TIM2_ITConfig(TIM2_IT_UPDATE, ENABLE);
  //Enable TIM2
       TIM2_Cmd(ENABLE);

}

bool DS18_Write(u8 data)
{
  disableInterrupts();
  for ( u8 i=0;i<8;i++)
  {
   DS18(0);
   Delay_us(1); //Delay1(0); //Start time slot 4,5 us
   if( data & (1<<i)) DS18(1)
     //else DS18(0);
   Delay_us(160);  // 60us end time slot
   DS18(1);
   //Delay1(0);
  }
  enableInterrupts();
  return TRUE;

}


u8  DS18_Read()
{
    //Init DS18b20 data pin as Input

  u8 data=0;
    disableInterrupts();
  for (u8 i=0;i<8;i++)
  {
    DS18(0);
    Delay_us(1); //Start time slot 4,5 us
    DS18(1);
    Delay_us(35); // Wait for ds18b20 set bit 15us
    //Delay1(0);
   data +=((1<<i)*(GPIO_ReadInputPin(GPIOD,ds18_data)&&ds18_data));
    Delay_us(120); // Wait 60 us until end of read slot  45us
    //  DS18(1);  // Next bit
   // Delay1(0);

  }
    enableInterrupts();
    //Init DS18b20 data pin
   // GPIO_Init(GPIOD,ds18_data,GPIO_MODE_OUT_OD_HIZ_FAST);
   return data;
}

bool DS18_Reset()
{
   //Init Reset Pulse
    DS18(0);
    Delay1(25);    //25=524us
    DS18(1);
    //Delay1(1);
    timer2=0;
    while ((timer2 < 10000) && (GPIO_ReadInputPin(GPIOD, ds18_data)));;   //Wait for ack from DS18B20
    if (timer2>=10000) return FALSE;
    // Delay1(10);
    Delay1(20);    //25=524us

    return TRUE;
}

u8 temperature ()
{

   //Init Reset Pulse
     if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  CONVERT T [44h]
    DS18_Write(0x44);
    //Wait util end convert
    timer2=0;
     while ((timer2 < 10000) && !(DS18_Read()));;
      if (timer2>10000) return FALSE;
     //u8 temp8=timer2;
    //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    // Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function command READ SCRATCHPAD [BEh]
    DS18_Write(0xBE);
     u8 temp1=DS18_Read();
     u8 temp2=DS18_Read();
    DS18_Reset();
      u16 result = temp2*256+temp1;
      temp1= (u8)(result>>3);
     return temp1;
}

bool Read_DS18()
{

   //Init Reset Pulse
     if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  CONVERT T [44h]
    DS18_Write(0x44);
    //Wait util end convert
    timer2=0;
     while ((timer2 < 10000) && !(DS18_Read()));;
      if (timer2>10000) return FALSE;
     //u8 temp8=timer2;
    //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    // Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function command READ SCRATCHPAD [BEh]
    DS18_Write(0xBE);
     u8 temp1=DS18_Read();
     u8 temp2=DS18_Read();
     u8 temp3=DS18_Read();
     u8 temp4=DS18_Read();
     u8 temp5=DS18_Read();
     u8 temp6=DS18_Read();
     u8 temp7=DS18_Read();
     u8 temp8=DS18_Read();
     u8 temp9=DS18_Read();

     DS18_Reset();

      line_lcd=0;
      result2=0;
      u16 result = temp2*256+temp1;
      result1= (u8)(result>>3);
      if(result1%2!=0) result2=5;
      result1 /=2;


