claudiustradamus/stm8s105k-controller/Project/STM8S_StdPeriph_Template/main.c
      printf("\n%d.%d",result1,result2);
     // printf("\n%02x%02x%02x",temp1,temp2,temp5);
     //line_lcd=1;
     // printf("\n%02x%02x%02x",temp7,temp8,temp9);
     // while (!key_ok_on());

     //u8 temp3=DS18_Read();

    return TRUE;
}

bool DS18Set ()
{
     //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  WRITE SCRATCHPAD 0x4E
    DS18_Write(0x4E);
   //Write 3 bytes last is config reg
    DS18_Write(125);
    DS18_Write(0xDC); //-55
    DS18_Write(0x1F);




  return TRUE;
}




 /*
u16 Average()
{
 //Find average in measure
  u8 i=0;
  u16 Summa=0;
  do
  {
   Summa+=measure[i++];
  } while ( measure[i]!=0);
   if(i!=0) Summa=Summa/i;
   return Summa;
}
   */

PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
      //USART_SendData(USART3, (u8) ch);
     LCD(ch);
   /* Loop until the end of transmission */
    //while(USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET);;
  return ch;
}


void Delay1(u16 Delay)
{
    //1 = 40us,2=60us,3=80us,10=200us, 15=320us,
  timer1=0;
  while ( timer1 < Delay); ;
}

 void Delay2(u16 Delay)
{
  timer2=0;
  while ( timer2 < Delay); ;
}


void Delay_us (u16 time) //1:3.2us,100:39us,200:77us,35:15.2us,120:45us,160:60us
{
  //disableInterrupts();
  do
    {
      time--;
      nop();
    }
    while (time);
  //enableInterrupts();
}



/*
void Delay12 (u16 Delay)
{
  timer2=0;
  while ( timer2 < Delay); ;
}
*/


#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {

  }
}
#endif


void Display_Line(char* line)
{
  char current_char= *line++;
  u8 count;
    //Set Cursor to First Line
   LCDInstr(0x80 | 0x00);
   count=0;
   Delay1(1);
  do
  {

    if (current_char > 0x1b)   //Display only valid data
     {
       LCDData(current_char);
        Delay1(1);
       count++;
     }
     current_char=*line++;
  }  while ((current_char != 0x00) && (count<7));

   Rotate_Line(line1);

}

void Rotate_Line( char * line)
{

   char temp_first = *line;
   char temp_next;

   do
   {
      temp_next=*(line+1);
     *line++=temp_next;
      //line++;
      //temp_next=*line;
     //*line=*line++;
   } while (*line !=0);
   line--;
   *line=temp_first;

}

void Clear_Line1 ()
{
     //Set Cursor to First Line
   LCDInstr(0x80 | 0x00);
   count=0;
   Delay1(1);
    u8 count=0;
   do
   {
     LCDData(' ');
        Delay1(1);
        count++;
   }while (count<8);


}





/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
